Catalogs/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Задачи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Договоры</xr:Item>
				<xr:Item>Catalog.БиблиотекаПроцессов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодовоеНаименование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниClado</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторонаЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоКИсполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДефекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПотребности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнструментыТОИР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИсторияИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзменения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначениеХарактеристик</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПричины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПричинПереносаСроков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегическиеЦели</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазваниеРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Задачи/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ  Тогда
		//меняем дату окончания родительских задач
		
		Если ЗначениеЗаполнено(Родитель) 
			И Родитель.ДатаОкончания < ДатаОкончания Тогда
			ЗадачаОб = Родитель.ПолучитьОбъект();
			ЗадачаОб.ДатаОкончания = ДатаОкончания;
			//ЗадачаОб.ДополнительныеСвойства.Вставить("ИзменениеДатыОкончания", Истина);
			ЗадачаОб.Записать();
		КонецЕсли;
	КонецЕсли;
	
	// Начало Изменение реквизитов
	Если Константы.ИспользоватьЛогирование.Получить()  Тогда
		Если ДополнительныеСвойства.Свойство("АвторИзменения") Тогда
			АвторИзменения = ДополнительныеСвойства.АвторИзменения;
		Иначе
			АвторИзменения = Пользователи.ТекущийПользователь();
		КонецЕсли;
		ЕстьЗаписиВРегистреИзменения = ИзменениеРеквизитовСервер.ЕстьЗаписиВРегистреИзменения(Ссылка);
		Если Не ЕстьЗаписиВРегистреИзменения Тогда
			ИзменениеРеквизитовСервер.ЗаписатьИзмененныеРеквизиты(ЭтотОбъект, Истина, АвторИзменения);
		КонецЕсли;
		Если НЕ (ДополнительныеСвойства.Свойство("ИзмененияОбработаны")
			И ДополнительныеСвойства.ИзмененияОбработаны) 
			И ЕстьЗаписиВРегистреИзменения Тогда
			ИзменениеРеквизитовСервер.ЗаписатьИзмененныеРеквизиты(ЭтотОбъект,,АвторИзменения);
		КонецЕсли;
	КонецЕсли;
	// Конец Изменение реквизитов
	
	// Начало Изменение даты окончания
	Если НЕ Константы.ИспользоватьЛогирование.Получить()  Тогда
		Если ДополнительныеСвойства.Свойство("АвторИзменения") Тогда
			АвторИзменения = ДополнительныеСвойства.АвторИзменения;
		Иначе
			АвторИзменения = Пользователи.ТекущийПользователь();
		КонецЕсли;
		ЗаписатьИзмененныеРеквизиты(ЭтотОбъект, ДатаОкончания, АвторИзменения);
	КонецЕсли;
	// Конец Изменение даты окончания
	
	Если ДополнительныеСвойства.Свойство("НоваяСторонаЗадачи") Тогда
		//поменять сторону у всех подчиненных задач
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	Задачи.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Задачи КАК Задачи
		               |ГДЕ
		               |	Задачи.Ссылка В ИЕРАРХИИ(&Ссылка)
					   |	И НЕ Задачи.Ссылка = &Ссылка";	
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗадачаОб = Выборка.Ссылка.ПолучитьОбъект();
			ЗадачаОб.СторонаЗадачи = ДополнительныеСвойства.НоваяСторонаЗадачи;
			ЗадачаОб.ДополнительныеСвойства.Вставить("ИзменениеСтороныЗадачи", Истина);
			ЗадачаОб.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ДополнительныеСвойства.Свойство("ИзменениеСтороныЗадачи") 
		и Ссылка.СторонаЗадачи <> СторонаЗадачи Тогда
		ДополнительныеСвойства.Вставить("НоваяСторонаЗадачи", СторонаЗадачи);
	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
		Если НЕ Пользователи.ЭтоПолноправныйПользователь()
			И Пользователи.ТекущийПользователь().Сотрудник <> Владелец.Администратор Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Устанавливать или снимать пометку удаления может только администратор договора.");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьИзмененныеРеквизиты(ЭтотОбъект, ДатаОкончания, АвторИзменения) Экспорт
	ПоследняяДата = ПолучитьПоследниеИзмененияРеквизитовДатаОкончания(Ссылка);
	
	Если ПоследняяДата = Неопределено Тогда
		МЗ = РегистрыСведений.ИсторияИзменения.СоздатьМенеджерЗаписи();
		МЗ.Объект = ЭтотОбъект.Ссылка;
		МЗ.Пользователь = АвторИзменения;
		МЗ.Период = ТекущаяДатаСеанса();
		МЗ.НазваниеРеквизита = "ДатаОкончания";
		МЗ.Значение = ДатаОкончания;
		МЗ.Причина = "начальное заполнение";
		
		МЗ.Записать(Истина);
	Иначе
		
		Если ПоследняяДата <> ДатаОкончания Тогда 
			МЗ = РегистрыСведений.ИсторияИзменения.СоздатьМенеджерЗаписи();
			МЗ.Объект = ЭтотОбъект.Ссылка;
			МЗ.Пользователь = АвторИзменения;
			МЗ.Период = ТекущаяДатаСеанса();
			МЗ.НазваниеРеквизита = "ДатаОкончания";
			МЗ.Значение = ДатаОкончания;
			МЗ.Причина = "изменение пользователем";
			
			МЗ.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПоследниеИзмененияРеквизитовДатаОкончания(Ссылка)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсторияИзмененияСрезПоследних.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ИсторияИзменения.СрезПоследних(
	               |			,
	               |			Объект = &Объект
	               |				И НазваниеРеквизита = ""ДатаОкончания"") КАК ИсторияИзмененияСрезПоследних";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;	
	Иначе 
		Возврат Неопределено
	КонецЕсли;
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	ПринятоКИсполнению = Ложь;
КонецПроцедуры
